{"vocab_size": 128256, "max_position_embeddings": 131072, "hidden_size": 4096, "intermediate_size": 14336, "num_hidden_layers": 32, "num_attention_heads": 32, "num_key_value_heads": 8, "hidden_act": "silu", "initializer_range": 0.02, "rms_norm_eps": 1e-05, "pretraining_tp": 1, "use_cache": true, "rope_theta": 500000.0, "rope_scaling": {"factor": 8.0, "high_freq_factor": 4.0, "low_freq_factor": 1.0, "original_max_position_embeddings": 8192, "rope_type": "llama3"}, "attention_bias": false, "attention_dropout": 0.0, "mlp_bias": false, "head_dim": 128, "return_dict": true, "output_hidden_states": false, "torchscript": false, "dtype": "float16", "pruned_heads": {}, "tie_word_embeddings": false, "chunk_size_feed_forward": 0, "is_encoder_decoder": false, "is_decoder": false, "cross_attention_hidden_size": null, "add_cross_attention": false, "tie_encoder_decoder": false, "architectures": ["LlamaForCausalLM"], "finetuning_task": null, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "task_specific_params": null, "problem_type": null, "tokenizer_class": null, "prefix": null, "bos_token_id": 128000, "pad_token_id": 128004, "eos_token_id": 128001, "sep_token_id": null, "decoder_start_token_id": null, "max_length": 20, "min_length": 0, "do_sample": false, "early_stopping": false, "num_beams": 1, "temperature": 1.0, "top_k": 50, "top_p": 1.0, "typical_p": 1.0, "repetition_penalty": 1.0, "length_penalty": 1.0, "no_repeat_ngram_size": 0, "encoder_no_repeat_ngram_size": 0, "bad_words_ids": null, "num_return_sequences": 1, "output_scores": false, "return_dict_in_generate": false, "forced_bos_token_id": null, "forced_eos_token_id": null, "remove_invalid_values": false, "exponential_decay_length_penalty": null, "suppress_tokens": null, "begin_suppress_tokens": null, "num_beam_groups": 1, "diversity_penalty": 0.0, "_name_or_path": "unsloth/Meta-Llama-3.1-8B-bnb-4bit", "transformers_version": "4.57.5", "model_type": "llama", "quantization_config": {"quant_method": "bitsandbytes", "_load_in_8bit": false, "_load_in_4bit": true, "llm_int8_threshold": 6.0, "llm_int8_skip_modules": ["lm_head", "multi_modal_projector", "merger", "modality_projection"], "llm_int8_enable_fp32_cpu_offload": false, "llm_int8_has_fp16_weight": false, "bnb_4bit_quant_type": "nf4", "bnb_4bit_use_double_quant": true, "bnb_4bit_compute_dtype": "bfloat16", "bnb_4bit_quant_storage": "uint8", "load_in_4bit": true, "load_in_8bit": false}, "unsloth_fixed": true, "tf_legacy_loss": false, "use_bfloat16": false, "output_attentions": false, "architecture": "NeuroplasticLlamaSCAv2", "num_tasks": 10, "base_model_name": "unsloth/Meta-Llama-3.1-8B-bnb-4bit", "sca_config": {"hidden_size": 4096, "block_size": 32, "block_rank": 4, "top_k": 3, "sigma": 1.0, "refractory_steps": 100, "inhibition_lambda": 0.0, "inhibition_radius": 1.5, "use_cuda": false, "grid_size": 16, "spmm_impl": "cuda_spmm", "soft_mask": true}, "kv_cache": {"int4_quantization": true, "cpu_offload": true}}